# encoding=utf-8
import matplotlib.pyplot as plt

if __name__ == '__main__':

    num1 = [0.195, 0.380, 0.493, 0.531, 0.551, 0.567, 0.579, 0.589, 0.597, 0.603]
    num2 = [0.185, 0.28500000000000003, 0.32499999999999996, 0.349, 0.361, 0.37, 0.382, 0.393, 0.403, 0.41300000000000003]
    num3 = [0.135, 0.185, 0.2, 0.215, 0.22999999999999998, 0.245, 0.26, 0.275, 0.29000000000000004, 0.305]
    # num1 = [0.25368780895532905, 0.5086759130827148, 0.5086981050435715, 0.5485243600753691, 0.5052650120016899, 0.531016281344123, 0.5065017722052918, 0.5124453737208512, 0.5507330870093899, 0.557994755704982]
    # num2 = [0.3690722865788686, 0.4956543889184055, 0.48039378187945886, 0.48067398293222263, 0.463807713247677, 0.45623341331658507, 0.4262758348648471, 0.4328033153532235, 0.4572986848112273, 0.48251607697427845]
    # num3 = [0.3188481896544178, 0.46237269361701383, 0.45524745733366473, 0.4780343183742225, 0.4463509602081463, 0.4517408517595589, 0.43823632682574737, 0.44382959335844924, 0.4597567605227673, 0.46147704827615077]
    num = [num1,num2,num3]
    # num.reverse()
    plt.rcParams['font.sans-serif'] = ['SimHei'] # 可以解释中文无法显示的问题
    x = [20, 40, 60, 80, 100, 120, 140, 160, 180 ,200]
    plt.grid(ls='--')
    lable = ['FC based Caching', 'MPC based Caching', 'Proposed Caching'] # 折现名称
    markes = ['-o', '-^', '-*'] # 折现显示形状
    lable.reverse()
    print(num)
    for link in range(len(num)):
        plt.plot(x,num[link],markes[link],label = lable[link])
    plt.margins(0)
    plt.subplots_adjust(bottom=0.10)
    plt.xlabel('Number of User')  # X轴标签
    plt.ylabel("Cache Hit Ratio")  # Y轴标签
    plt.yticks([0, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7])
    plt.xticks(x)
    #plt.title("A simple plot") #标题
    plt.legend()
    plt.rcParams['savefig.dpi'] = 500  # 图片像素
    plt.rcParams['figure.dpi'] = 500  # 分辨率
    plt.savefig("user_number_impact.png")
    plt.show()